const { factorialIt, rec } = require('./index.js');

describe('factorialIt', () => {
  it('возвращает факториал положительного числа', () => {
    expect(factorialIt(5)).toBe(120); // 1*2*3*4*5
  });

  it('возвращает 1 для 0', () => {
    expect(factorialIt(0)).toBe(1); // по определению факториала
  });

  it('выбрасывает ошибку для отрицательного числа', () => {
    expect(() => factorialIt(-3)).toThrow('Введите число больше нуля');
  });
});



describe('rec (рекурсивный факториал)', () => {
  it('возвращает факториал положительного числа', () => {
    expect(rec(5)).toBe(120); // 5! = 120
  });

  it('возвращает 1 для 0', () => {
    expect(rec(0)).toBe(1);
  });

  it('выбрасывает ошибку для отрицательного числа', () => {
    expect(() => rec(-3)).toThrow('Введите число больше нуля');
  });
});
